package com.company.JAVA基础笔记7;

/*
* 集合与数组的区别：
*       A：长度区别
*               数组长度固定
*               集合长度可变
*       B：内容不同
*               数组存储的是同一种类型的元素
*               而集合可以存储不同类型的元素
*       C：元素的数据类型问题
*               数组可以存储基本数据类型，也可以存储引用数据类型
*               集合只能存储引用类型
* */

/*
* 集合的使用步骤：
*       A：创建集合对象
*       B：创建元素对象
*       C：把元素添加到集合
*       D：遍历集合
*               a：通过集合对象获取迭代器对象
*               b：通过迭代器对象的hasNext()方法判断是否有元素
*               c：通过迭代器对象的next()方法获取元素并移动到下一个位置
*
* */

public class 集合 {
    public static void main(String[] args) {

    }
}
